checkfree/src/test/resources/expected/test_helloworld_greetMe.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><tns:greetMe xmlns:tns="http://apache.org/hello_world_soap_http/types">
  <tns:requestType xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="tns:MyStringType">***NO DATA***</tns:requestType>
</tns:greetMe></SOAP-ENV:Body></SOAP-ENV:Envelope>