checkfree/src/test/resources/expected/execute/test_helloworld_greetMe.xml

<?xml version="1.0" encoding="UTF-8"?><SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tns="http://apache.org/hello_world_soap_http/types" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><SOAP-ENV:Body><tns:greetMe><tns:requestType>a</tns:requestType></tns:greetMe></SOAP-ENV:Body></SOAP-ENV:Envelope>